# 6주차 데이터 분석 2
---

- Lecture 42 - Groupby on DataFrame

---

## Groupby on DataFrame

In [2]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [27]:
dframe = DataFrame({
        'k1':['X','X','Y','Y','Z'],
        'k2':['alpha','beta','alpha','beta','alpha'],
        'dataset1': [4,'a',1,5,6],
        'dataset2': [1,2,3,4,5]})

dframe

  dataset1  dataset2 k1     k2
0        4         1  X  alpha
1        a         2  X   beta
2        1         3  Y  alpha
3        5         4  Y   beta
4        6         5  Z  alpha

In [13]:
dframe['dataset2'].groupby(dframe['k2']).mean()

k2
alpha    3
beta     3
Name: dataset2, dtype: int64

In [15]:
# dataset1 column을 잡아서, 'k1' column으로 group by합니다. ('k1'을 group key라고 합니다.)
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1.mean()

k1
X    3
Y    3
Z    6
Name: dataset1, dtype: int64

In [18]:
# 해당 group의 첫번째 녀석들만 가져오세요
group1.first()

k1
X    4
Y    1
Z    6
Name: dataset1, dtype: int64

In [21]:
group1.last()

k1
X    2
Y    5
Z    6
Name: dataset1, dtype: int64

In [22]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [33]:
dframe.groupby([cities,month]).first()

       dataset1  dataset2 k1     k2
LA FEB        a         2  X   beta
   JAN        1         3  Y  alpha
NY FEB        5         4  Y   beta
   JAN        4         1  X  alpha

In [29]:
dframe

  dataset1  dataset2 k1     k2
0        4         1  X  alpha
1        a         2  X   beta
2        1         3  Y  alpha
3        5         4  Y   beta
4        6         5  Z  alpha